'use strict';
document.getElementById('text001').textContent = "\
  ========================================\n\
  ＜豚汁＞（３０分）\n\
  \n\
  --- 材料（適量） ---\n\
  ・豚バラ肉\n\
  ・ジャガイモ、大根、にんじん、ごぼう、ネギ\n\
  ・こんにゃく\n\
  ・ほんだし、みそ\n\
  \n\
  --- 工程１　切る ---\n\
  ・食べやすい大きさに全部切る\n\
  ・ごぼうとこんにゃくには、下準備があるらしい\n\
  \n\
  --- 工程２　炒める ---\n\
  ・肉を炒める。その後、野菜も一緒に炒める\n\
  ・こんにゃくも少し炒めるらしい\n\
  \n\
  --- 工程３　煮る ---\n\
  ・水とほんだしを加えて煮る。あくをとる。蓋をして１０分\n\
  ・味噌を溶かしながら、適度に入れる。\n\
  \n\
  ！！完成！！\n\
  ========================================\n\
";
