'use strict';
document.getElementById('text003').textContent = "\
  ========================================\n\
  ＜野菜炒め＞（２０分）\n\
  \n\
  --- 材料（適量） ---\n\
  ・豚肉（切り落とし）\n\
  ・（小さじ１）酒、醤油、砂糖、塩\n\
  ・玉ねぎ、もやし、にんじん、きゃべつ\n\
  \n\
  --- 工程１　切る ---\n\
  ・食べやすい大きさに切る\n\
  ・豚肉の下準備はした方がいいかも\n\
  （酒（小１）、醤油（小１）、ショウガ汁（小１）でもみこみ、\n\
    片栗粉（小２）をまぶす）\n\
  \n\
  --- 工程２　炒める ---\n\
  ・炒める順番 -> 豚肉 -> 玉ねぎ、にんじん -> もやし、きゃべつ\n\
  ・醤油、砂糖、塩、酒で味を調えて、仕上げ\n\
  \n\
  ！！完成！！\n\
  ========================================\n\
";
