(function () {
    'use strict';
    document.getElementById("text002").textContent ='\
      セミコロンはいらない\n\
      モジュールがいっぱい\n\
      インデントが重要、インデントがすべて\n\
      自由度が高い\n\
      コメントアウトは#\n\
      ========================================\n\
      ＜型の宣言などいらない＞\n\
      a = 1\n\
      b = True\n\
      c = "string"\n\
      ========================================\n\
      ＜条件分岐＞\n\
      switch文はない\n\
      if 条件式 :\n\
        /* １ */\n\
      elif 条件式 :\n\
        /* 2 */\n\
      else :\n\
        /* その他 */\n\
      ========================================\n\
      ＜ループ＞\n\
      for文が強い\n\
      for 変数 in range(値):\n\
        /* 繰り返し */\n\
      range()の部分にはリストだったり、\n\
      いろいろおける\n\
      range(5) -> 0,1,2,3,4\n\
      range(1,5) -> 1,2,3,4\n\
      range(0,10,3) -> 0,3,6,9\n\
      while 条件式:\n\
        /* 繰り返し */\n\
      ========================================\n\
      ＜リスト＞\n\
      配列みたいなもの\n\
      a = ["a", "b", "c"]\n\
      b = [1,2,3]\n\
      a.append("d") 追加\n\
      del a 削除\n\
      len(a) 長さ\n\
      ========================================\n\
       ';
}());
