'use strict';
document.getElementById("text002").textContent ='\
  ========================================\n\
  C言語も使える\n\
  ========================================\n\
  iostream\n\
  cout 出力( c + out )\n\
  cin 入力( c + in )\n\
  ========================================\n\
  using namespace std;\n\
  この名前空間を使うよ\n\
  [::]は、スコープ解決演算子と言うらしい（重要）\n\
  std::cout\n\
  どの名前空間のメンバ関数か指定する\n\
  ========================================\n\
  ＜クラス＞\n\
  class CLASS_NAME\n\
  {\n\
    private:\n\
      /* 非公開 */\n\
    public:\n\
      /* 公開 */\n\
  }\n\
  ========================================\n\
';
